[{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "oRBb4iVjSJehtZVYKJrsbA", "review_id": "c409xCjA8I4vAipAgPq35A", "text": "The meal was ok, but the service was rather rude in my opinion.  You would think ordering an espresso out of order with the meal would not demand ridicule from the servers.  Can a guy just be tired and have some caffeine?  I guess that is just too outside social norms to be allowed.", "business_id": "-TIlp6V8ExFIXnJ3M0BWwA", "stars": 2, "date": "2009-03-12", "type": "review"}, {"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "qXLte7ikUM-__NHU5RaUgg", "review_id": "nqNHZ0qos06kkfLM88Hwwg", "text": "You know im not even angry with them, im actually annoyed at myself for agreeing to even walk in the door of this place!\n\nWhen La Tasca starting taking the UK & Ireland by storm 7 years ago they offered an All Bar One approach to restaurant experience - create something good then replicate it x 10! And it worked - it was nice - sangria, decent grub, served up by friendly staff!\n\nWhat the hell happened.........!!!!\n\nSince then their prices have come down but the food is now a distaster! Deep fried or microwaved rubbish! Tasteless or over salted its just a shame!!\n\nIts just a classic fail, over expanded menu, too many ingredients = disaster!!\n\nFor the love of god please just close it down or go back to where you started! The fact a restaurant on St Andrews Square has 2 reviews in 7 years says all you need to know!", "business_id": "-TIlp6V8ExFIXnJ3M0BWwA", "stars": 1, "date": "2011-07-19", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oEY3HDVHcXmkKzQzSBsksA", "review_id": "5bS0u27T3sy4P4KvyK4ujQ", "text": "Great location in the city center with the Castle close by. It was such a nice way to end our time in Edinburgh. \n\nI was a Tapas virgin until I came here and the waiters were super friendly and helpful. I think even the manager of the restaurant came by at one point so I feel like they are making a real effort since the time the other reviews were posted. The staff was friendly and gave us plenty of time to ponder and order, explaining as they went and asking about whether we had been previously. In fact, they were so attentive that I was surprised when my boyfriend told me it was a chain!\n\nThe food was pretty much an A. I have had Tapas a couple time since then and the food has basically tied with this place with no clear surpassers in terms of flavors. However, the menu seems to have changed quite a bit in the past 6 months or so?\n\nThe interior is quite the contrast to the formal facade. It's rustic with truly Spanish inspired art and warm yellow coloring. The lacquered wood furnishings and bright accents really make you feel like you're in the country itself. Many different kinds of people sat amid the animated pillows making it comfortable and welcoming. Good for date nights or family dinners and anything in between!", "business_id": "-TIlp6V8ExFIXnJ3M0BWwA", "stars": 4, "date": "2012-10-14", "type": "review"}]