[{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "Rx73o7uXKAfKUuOKWYmyxA", "review_id": "9Sw9Oe2z9LiYBio6bn_r_A", "text": "My fiancee and I really enjoyed working with Emily for our engagement session.  She got to know us a bit before hand by asking us about ourselves.  She made us feel comfortable and I feel that the pictures show this. She followed our lead and did not force any \"awkward\" shots.   She was very professional and showed us the final product in a very timely manner.  We even got some sneak peeks through email a few days after our session.  The cost of the engagement session was also very reasonable.  \n\nI love the final product and since we have the DVD, we will have these pictures forever!", "business_id": "ryyUldbIXZBRk72EFt9cWg", "stars": 5, "date": "2010-06-22", "type": "review"}, {"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "_pC0vVtYJ2Fe35t0qTPzdQ", "review_id": "J5regmRp8YgXExbBR7E-pg", "text": "My husband and I had a great experience working with Emily and Karman (her second shooter) for our wedding. We were planning our wedding from afar (we were living in Maryland, but got married up in NH near where Emily was based at the time) but chatted via phone several times and she even made time to meet up with us when she came down to DC on a personal trip. We were quite clueless when it came to planning the wedding and Emily's questions helped us a lot in figuring out what decisions we needed to make (she also provided good advice when decisions came up)!\n\nThe day of, she scoped out a \"first look\"/wedding party pictures location before coming up to take pictures of us getting ready which was great since we were on a fairly tight time-frame and it made things go really smoothly. Although both my husband and I are a bit camera shy, neither of us felt uncomfortable with Emily taking pictures. She even stayed a bit longer than we had agreed to originally so she could get a few shots of the dancing (even though she was moving the very next day).\n\nIn the end, we absolutely loved our pictures. We got lots of compliments on the pictures and will treasure them forever. We love that we got to keep a DVD with all of the pictures so that we can print whichever ones we want whenever we want. We had a wonderful experience with Emily and highly recommend her!", "business_id": "ryyUldbIXZBRk72EFt9cWg", "stars": 5, "date": "2011-03-04", "type": "review"}, {"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "grxL8HuxeLYbTbEc8pb7sg", "review_id": "6p-5EfMnHxBmAq4TWUAIAA", "text": "We had our engagement photos taken by Emily at Floyd Lamb Park here in North Las Vegas. From checking out her website and photo galleries, I was pretty excited to meet her! I just love the style of her photography- very fresh! I met her at the Summerlin Bridal Show, and I knew she would be the photographer we would hire for our engagement photo session. From first meeting her, she was very laid back and professional. She is so easy to talk to and work with- she makes you feel comfortable when taking photos- and that's how you get great photos! I would highly recommend her for any of your photography needs!", "business_id": "ryyUldbIXZBRk72EFt9cWg", "stars": 5, "date": "2011-05-24", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "_IBWSXocgmX-m20Dm4m2YA", "review_id": "Tw1dtMO-E7PhpyhtMwVSuw", "text": "Emily did an amazing job on our engagement photos. Since we're both kinda recent newbies to Vegas she understood my need to have a non-Vegas vibe to our photos. We picked a great location and ended up having a great time. She's super easy to get along with and really values what you have to say in terms of photo styles. She really made us feel comfortable on the day of our shoot and it made our photos turn out fabulously. When it came time for her to put our book together she had a ton of different ideas and ways to do it. We trusted her to pick the best photos to put in the album and not only did we love it but it was a hit at our reception. She put little questions in there for people to answer which everyone loved, it was different than the traditional engagement signing book. We loved working with her and would totally recommend her to other people!!", "business_id": "ryyUldbIXZBRk72EFt9cWg", "stars": 5, "date": "2011-07-19", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K3aZ3q_esCKqvaTf9BMjfw", "review_id": "2FAOekPMWSbnFbmUjcM-tQ", "text": "I'll echo other comments about Emily and say that my fiance and I had a fantastic experience working with her. She made planning easy, was extremely generous with her time and help during our shoot, and did a fantastic job editing our photos. \n\nPLANNING:\nMy fiance and I were initially a bit worried getting taking pictures in an unknown place with an unknown photographer, and Emily made the decision much easier. She understood what we wanted, made good suggestions, asked questions, and provided us lots of examples of her work. She emailed me a long list of places where we could get pics taken, along with links and some sample photos. She also helped us find a stylist when our hair and make-up person flaked out at the last minute.\n\nTHE SHOOT:\nWe got to Emily's place early in the morning at 4am because we wanted to get going before it was hot. We made a few embarrassingly novice mistakes - forgetting to press my fiance's dress, and having a stylist without having done a trial run. Emily and her assistent sacrificed extra sleep and time from the shoot by helping us steam the dress, and making helpful suggestions on make-up and hair.\n\nEmily's style during the shoot was to stay fairly hands off, encouraging us to interact naturally and taking lots of pictures from different angles with different background. At one point some miniature buggies stopped at the side of the road, and Emily convinced the owner to let us take some photos in them. I appreciated the spontaneity, and they yielded some really good shots.\n\nPHOTOS:\nEmily got our photos back to us in a couple weeks, edited down to about 180 that she liked. She had touched up all of them, and obviously spent extra time on a few of the better ones. There were a few black and white shots, and a good variety of angles and interactions. We opted to order a hi-res copies, and she sent them immediately on a custom printed DVD. Overall, I was quite happy with her technical work.\n\nCONCLUSION:\nWe were lucky to find Emily as our photographer. She was helpful, friendly, and a pleasure to work with.", "business_id": "ryyUldbIXZBRk72EFt9cWg", "stars": 5, "date": "2011-09-03", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sBrTuH9q6h-1fJhXHoT-kQ", "review_id": "uxZu3Fa7gmyQBmbvkNFulw", "text": "If you are looking for a photographer, look no further! \n\nMy husband and I were very lucky to work with Emily for our engagement photos (Oct 2011).  We found her searching online for photographers in Las Vegas and her images and reviews really caught our eye.  She is able to capture images that look completely natural and she knows exactly how to make people comfortable and let their true personalities and beauty shine through.  \n\nEmily is very professional and easy to work with.  She really listens to what you are looking for.  I would have loved to use her for my wedding but we had already booked someone else.  I highly recommend her and I look forward to using her for our family photos in the near future!", "business_id": "ryyUldbIXZBRk72EFt9cWg", "stars": 5, "date": "2012-05-29", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CSiEHsZctUCk37QbWud21Q", "review_id": "Lg_NMmtV8KVM51PMfq-x8Q", "text": "I hired Emily to do newborn photos for my daughter.  She came to us (so convenient with a 3-day old!) and brought over multiple props.  Emily knew how to position our daughter and the photos came out so beautifully!  I was surprised at how quickly the photos were ready.  We are ordering 2 large canvases from her and can't wait until they arrive.  \n\nHer website is also gorgeous, easy to navigate, and it's easy to order prints.\n\nUPDATE: Emily did our family photos for our Christmas card and also our daughter's 1st birthday party. She is wonderful!  It shows her range as a photographer. Love!", "business_id": "ryyUldbIXZBRk72EFt9cWg", "stars": 5, "date": "2012-08-03", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UH2zsU3O0EHetpKo043bww", "review_id": "17dN2Wnzeq8rZKGwenhIDg", "text": "After being engaged for almost 2 years, my fiance and I decided to do a last minute wedding in Las vegas with about 40 of our closest family and friends.  A destination wedding means twice the anxiety since you are working with unfamiliar vendors.  After lots of research we decided on Emily Ku as our photographer, and we could not be more pleased with our decision!  Emily is an incredible photographer, and an absolute sweetheart.  She put my bride at ease from the beginning, and was very accomodating with all of our (sometimes silly)  requests.  If you are reading this trying to decide on a Las Vegas photographer for your upcoming event, look no further than Emily Ku.  You will not be disappointed!", "business_id": "ryyUldbIXZBRk72EFt9cWg", "stars": 5, "date": "2012-10-19", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iG2qXJZE3IbRrTPgrTfRYQ", "review_id": "kG5hYez8w9aCQehl7zttOw", "text": "AAA-MA-ZING WORK! :) We had so much fun and our pictures really show that. The photos turned out so warm & lovely capturing all the perfect moments and our location spot was great! Thanks Em! xoxo", "business_id": "ryyUldbIXZBRk72EFt9cWg", "stars": 5, "date": "2013-10-08", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8wjAQC9C-AvRqC_ZncovLA", "review_id": "oQ3EjcRTRX-VD5uHM7vD2A", "text": "Love, love, love this boot camp! I avidly work out and this is one of the best work outs I have had. He always changes up the exercises and you get a complete total body work out. Good for people of all fitness types and sizes. You make it as hard as you want. Highly reccommend this class to anyone who wants to get in shape but put in the hard work to do so!", "business_id": "Bj2nIo6ALX9GoUvjBRzKyA", "stars": 5, "date": "2013-05-10", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n7lDRmgJ2MSeku2-TXODNw", "review_id": "LQPa7QDO64flRiB5X8ohjw", "text": "I can't even tell you how amazing this boot camp is!! I had been trying out different fitness groups to no avail. Then I found Mike's bot camp and was instantly hooked. I can go at my own pace with this boot camp and still get into rocking shape. I can already see a difference in my legs and arms after less than 2 weeks plus Mike is so helpful with helping me correct my form. I will definitely continue to go every morning session and some evenings too! If you want to get into great shape alongside awesome people and have tons of fun doing it go to this boot camp!", "business_id": "Bj2nIo6ALX9GoUvjBRzKyA", "stars": 5, "date": "2013-05-14", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tYSxE_-F23F-u0imldG_Ow", "review_id": "Rr22PGQGmF8h_81PRoa5PQ", "text": "I've been going to this boot camp for about six weeks now and can feel myself becoming stronger and stronger! Mike is a great leader and coach - he makes everyone feel comfortable whether they're experienced, or just starting out. Check out this boot camp if you want to work hard and have fun in the process!", "business_id": "Bj2nIo6ALX9GoUvjBRzKyA", "stars": 5, "date": "2013-05-29", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sSuC9e1nGR-5b6oaLMkggQ", "review_id": "vfNpQRCDHWiGVlzWuFwNkQ", "text": "I've seen a couple friends do a boot camp with another place once... and it kind of seemed... formulaic and brutal. Not a fun experience at all. So I never joined...\n\nI was around the volleyball courts of Sunset Park one day and I saw RBBC... looked a little more like a challenging game show (I am a game show nerd so I walked over).\n\nEasily the best boot camp I have ever seen, and the first and only I'd want to be a part of. The classes are challenging, but aren't mindnumbing. You are actually engaged. Mike switches things up every class so the things you did on Monday aren't necessarily the things you'll do Tuesday. And (the gameshow part), there is a game at the end of every workout, which literally milks every last drop of competitiveness you have.\n\nGreat classes, awesome instructor, and totally not monotonous. And the price was pretty solid too. Can't complain. (That and if I did, he'd probably make me do more burpees)", "business_id": "Bj2nIo6ALX9GoUvjBRzKyA", "stars": 5, "date": "2013-06-03", "type": "review"}]