[{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "saSUa7HoHrhupXmqSqUxcw", "text": "This is for the miserable excuse for a cafe and it's glum staff. The most depressed tuna melt I have eaten in my life.", "business_id": "5HVmBD0vznPVi2DlvF_ejQ", "stars": 1, "date": "2012-03-26", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "TfDNVxzjXsZl--WGiytT1g", "review_id": "UuhMbWmga0EyKHiR7Cg-KQ", "text": "Theres an atmosphere in Tesco that i feel is missing in Asda's & Morrisons. I cant really explain it, but suffice to say i feel more relaxed shopping in Tesco.\nI do agree that the worst suppermarket Cafés are in Tesco, but as they are franchised, i cant let that affect my review, however, 4 Stars since they have not upgraded to a Costa Franchise yet.", "business_id": "5HVmBD0vznPVi2DlvF_ejQ", "stars": 4, "date": "2013-02-16", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LH42NpK2sSyiMmvDMoG5HQ", "review_id": "tm4D43_mgY_ofVECWyuqmw", "text": "shopped here for years , absolutely rubbish , only go here as no other close by. I live 2 minutes away. Atmosphere terrible , shop staff look really miserable , and depressed. Shelves always empty , always an excuse about short staffed . Would benefit from a local competitor , like a Morrison's or sainsbury in musselburgh.", "business_id": "5HVmBD0vznPVi2DlvF_ejQ", "stars": 1, "date": "2014-01-14", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LH42NpK2sSyiMmvDMoG5HQ", "review_id": "w8YMopyXn_0OpuaV_P3_qg", "text": "Back in again yesterday , just after 5 in afternoon. What a pathetic excuse for a store . Shelves were once again empty , shockingly so this time . Each department had areas that reminded me of the old news reports of bare shelves in the old USSR , Butter , decimated , milk , few and far between ,  bread in very short supply. Place would be better laying bowling mats after 5 , then we could all have a worthwhile experience. They seem to think that by 5 pm , the day is over ,no one else wants the staples , so they don't bother replacing the stuff , the pensioners or unemployed folk take during the day. They really don't need to ask why the isles are very frequently empty of customers , and why the Tesco profits are on a downward trend , they appear to have given up , and be accepting defeat to the likes of Lidl , Aldi , and Icelands of the country.", "business_id": "5HVmBD0vznPVi2DlvF_ejQ", "stars": 1, "date": "2014-01-29", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sav3LcdqbclzQwRWwuezfw", "review_id": "WMH_DxuI-1Ex7NcnbCz-UA", "text": "Tesco of Musselburgh is a great place to shop at.\n\nToday I bought a bottle of \"Finest\" Vintage Cava (amazingly, with the addition of Chardonnay grapes, very unusual for a Cava) for only £6.99\n\nTheir coffees and teas are wonderful.", "business_id": "5HVmBD0vznPVi2DlvF_ejQ", "stars": 4, "date": "2014-05-24", "type": "review"}, {"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "C13ayCqCbA6Y2aVoDK7TKQ", "text": "Years ago as a kid growing up in Musselburgh, one of the challenges thrown down in front of you would be - which ice cream do you like more, Luca's or Di Rollo's?\n\nHands down, my response for the past 25 *cough cough* years has been Luca's. I wouldn't even sniff in the direction of Di Rollo's. But... you know what, time can change the old taste buds, and I can definitely say now that I have more than a little love for Di Rollo. It tastes creamier, I like the different flavours (raspberry ripple for the win! As is coconut). So now I tend to walk on the wild side, my opinions change, and I go against the tide of Luca's fans. \n\nNom.", "business_id": "LFf-IXdeb1nNil-BEQxQdA", "stars": 4, "date": "2011-06-17", "type": "review"}, {"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "xx563moGMzw2M15BddCwmw", "review_id": "Gffw41WleTPiC9p250gV_Q", "text": "So today I found myself in Musselburgh (in the physical rather than spiritual sense). \n\nThere was something quite unusual about standing eating an ice cream whilst I could see my breath, but it was a most satisfying experience. \n\nMy folks had been here many times, but I'm brand new to the great Musselburgh ice cream wars, so I decided to try both of the village favourite parlours.  Such indulgence, I know. \n\nTo compare the two establishments is like choosing between a Lamborghini and a Maserati.  Both are fabulous, but whilst the Maserati has a more subtle elegance, the Lambo is more \"in your face\".  \n\nThis was my experience with the ice cream flavours. The S. Luca ones were great, but definitely more light compared to the fuller flavour of DiRollo. \n\nI had a double cone with Peanut Butter Crunch (a smooth Peanut Butter Ice Cream with crunchy chocolate covered nut pieces) as well as the absolute standout Turkish Delight ice cream which was gorgeous. I'd never have thought Turkish Delight would go sooooo well with ice cream, but it was a winner. \n\nNo matter which flag you fly in the ice cream war, Musselburgh can count itself very lucky to have two such fantastic parlours.", "business_id": "LFf-IXdeb1nNil-BEQxQdA", "stars": 5, "date": "2013-02-24", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "15XD4nQKUSwE8Vc7iGBikQ", "review_id": "4oWffGQw_piE8Bl-_DXw2A", "text": "So we've bought a house that is low and behold a few doors down from Elena DiRollo's....we thought we'd pop in as it will be our new local confectionary store. We had some of the handmade chocolates and an ice cream. Oh yum. The flavouring of the handmade chocolates are spot on. I've just popped strawberry mousse one in my mouth just now and oh boy did it taste like strawberry. The staff are so friendly and patient! lol. I can't wait for when my wee one is grown up enough to pop in there as his local sweetie shop :) I had a fab one growing up and now I know he will too!", "business_id": "LFf-IXdeb1nNil-BEQxQdA", "stars": 5, "date": "2013-05-13", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_by5qmyrZgisBF7v90JWaQ", "review_id": "5PUT2kTZjVxvlqsYmKqi2w", "text": "One of the \"Great Edinburgh Mystery's\" Why does everyone Que outside Lucas in Musselburgh for a cone in the summer ?? when a far superior Ice Cream Parlour is just round the corner, many more delicious flavors ??? Oh,and hand made chocolates on offer too Which are v yummy !!", "business_id": "LFf-IXdeb1nNil-BEQxQdA", "stars": 4, "date": "2013-10-30", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3dgTdRn62kJy94TGO24heA", "review_id": "fimYHOa3Zt7lYmv-98u3PA", "text": "If you are a bride and groom to be, then you must admit that it's a jungle out there for wedding venues, all of them heading towards traditional virtues trying to understanding what it is the bridal party wants; then caters to their needs, be it for venue, transport, dress, food or otherwise?\n\nThe Quayside is conveniently situated almost right on Musselburgh beach, with a picturesque harbour opposite, small boats tied up...you get the picture, on sunny weekends or during festivals is packed with some type of private function. But with minimum competition; ok, perhaps a couple of places that might cater to similar style as this place nearby, I felt duty bound to find out if they were the best in the area, my luck was in early June.\n\nThe party I was invited to had actually won the entire wedding through a local Haddington newspaper. Well almost, they still have to iron out some creases, but hey when weddings cost as they certainly do, then it really pays to get this on. So thanks to the Courier as the organiser!\n\nThe decor inside the Quayside is dark wood, deep pile red-ish carpets, in and around the small bar downstairs, but past reception is their restaurant. Another bar upstairs on first floor and another on level 2. There is a lift for people that don't fancy or can't do the walk, but it's not that quick!\n\nWith adequate parking to the rear and side of the venue overlooking the harbour, it really pays to park as close to the venue as possible, especially as it rained heavily on the day in question, so it kind of ruined those precious wedding photos!\n\nWedding food was faultless but was it really that price(£75each according to the Bride's father), but we did get champs upon reception. Red and White wine with the dinner, roast chicken and haggis tower was a treat, as was choco pudding and cream (in the shape of a heart). With all that booze flowing some of our party later on just wanted a cup of tea, so when I requested this, the staff couldn't have been more accommodating, so top marks for producing a pot or two when they didn't really have to!\n\nFood booking drinks ambience were great, but you need three rules. 1. some ill placed seating meant my back was to the bridal table during speeches. To any future brides out there, save guests having a crick in the neck, check the table layout. 2. To make your perfect wedding even better, please get a band. 3. With reception closed well before 1am also make sure you prebook a taxi or this may incur a lengthy wait at the nearest taxi rank or bus stop.\n\nSpeaking of food, Quayside renamed their restaurant as the \"World Buffet\",(does exactly as is says). The name conjures up horrors of many a fast food joint. But with many foods available (and I did ask what they didn't produce) to which the answer was - no to fruit. But I ask you, after unlimited buffet food not many peeps will have room for fruit anyhow?\n\nRequiring another visit to experience since I was there for a wedding so couldn't appreciate this mass buffet experience. My mission should I choose to accept it is to find out, but if  the wedding food was anything to go by, they'll probably be ok???\n\nWorld Banq, musselburgh - One place many cuisines, all for £8.50, you try you decide?", "business_id": "FBzPxHL9tJYGw0uckrv3vg", "stars": 3, "date": "2013-06-05", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6GiCNlObz5jWy9PPSAXP7A", "review_id": "oeMJPWvKvdPpBO_-jb-ONQ", "text": "We went here to have a Christmas night with a group.\n\nBar prices were ok but the barmaid was a bit ditsy with the order and kept asking what we ordered!\n\nFood, \"Meh I've experienced FAR better\".  Don't come here if you like your food.  I won't be coming back.  it was edible but i could go the extra mile and it would be sensational!  I bit into a \"sausage\" and it wasn't appealing - the quality was water.  The mossaka was eh not a tad on my sister in laws which is proper greek and now I want some of her to make me feel better.\n\nThe Dj was shouty, very shouty with the microphone.  thank goodness for my hearing aids as i could turn down the shouty ness!!\n\nToilets were a sorry state.  With 2, yes 2 functions on the same floor you would think the priority was to have all toilets on working order.  with one out of order and toilet rolls at the sink getting wet.  it's a small space for ladies to washhands and dry them and try and get out.\n\nI been here once before for a wedding reception and can't remember it being that bad.  I won't be recommending the food from now on, it would be shameful if i did.\n\nThe seating arrangements were comfortable and the dance floor was big enough, hence 2 stars.  Meh, I've defo experienced better - hence the early departure!", "business_id": "FBzPxHL9tJYGw0uckrv3vg", "stars": 2, "date": "2013-11-30", "type": "review"}, {"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "WGLUmn9QB1ft940ctnC01Q", "text": "The first Thai restaurant I ever visited. The first Thai restaurant in Musselburgh - the two events strangely coincided. It was always a massive treat to go - such different flavours from what I had had before. Lemongrass since then has become a staple for me. Years on, it's still a favourite with me and has stood the test of time.", "business_id": "tdqZK2DXrmX5jyddy4uxmg", "stars": 5, "date": "2010-05-16", "type": "review"}, {"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "PntCSx2CS85Qsqf3hjv_aQ", "text": "ooooooh a whole lot of finger shaking going on for a very sub par delivery. Congealed pad thai and just cooked vegetable cakes. What was supposed to be a mini celebration turned into a mini-meh. Not awful, but expected much much better from Lanna Thai, so much so, downgraded 2 stars as hand on heart, that was a poor show of a meal. My last meal dining in the restaurant was still fine, so am putting it down to this being a takeaway meal and hoping the standards haven't slipped that far.", "business_id": "tdqZK2DXrmX5jyddy4uxmg", "stars": 3, "date": "2012-01-14", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "15XD4nQKUSwE8Vc7iGBikQ", "review_id": "RpzwP0v6aQMAQX2jUoyQUw", "text": "I have recently moved into the area so keen to weed out what is good and what's just not. So far within 2 weeks we've ate here twice. Once takeaway and the second time in the restaurant. \n\nI really like this place I have to say. The food is typically very tasty. The Pad Thai is plentiful and delicious (although it was better sitting in than takeaway which I imagine is because it's fresh out of the wok). We've had a whole range of starters thus far and only one which I would say was questionable on flavour. \n\nI'd be more than happy to take future visitors to the area into this place.\n\nAlthough I have to say what they do on flavour they lack in service so you've been warned! This place is packed at the weekends so I would recommend booking in advance. During the week it is actually still quite busy but they seem to put on a skeleton staff which doesn't make sense!", "business_id": "tdqZK2DXrmX5jyddy4uxmg", "stars": 4, "date": "2013-07-09", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uAX731aAjowPlLvA0nql_Q", "review_id": "Rq8XKrXmyuhRieBgKHRsfA", "text": "Friendly staff, didn't have to wait long for a table (busy Saturday evening) although later arrivals were having to wait up to 20 minutes.\nDrinks order taken as soon as we sat down, prompt service...but not rushed to order quickly.\nBoth had the 7oz Balmoral Sirloin steak, perfectly cooked to order (rare). Slightly too much haggis for the size of steak but otherwise good portion sizes.\nThe trio of desserts on a wooden board is a nice touch, a choice of six to choose from.", "business_id": "V43ZSii2SQ8DPlag09Ty9A", "stars": 4, "date": "2012-12-19", "type": "review"}, {"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "7EKIYqOKJYOsWjDgB_ZRtw", "review_id": "yeUox3AUifWjR91KPtPuVw", "text": "Handy location if you are driving to the Queen Margaret University campus from the south and are looking for lunch. Good food, menu more adventurous than typical pub grub. Let down by sluggish service. We sat for ages with table littered with finished plates, waiting staff were oblivious (it was a quiet Sunday), hence the average rating. If the service was a little snappier it would be four stars.", "business_id": "V43ZSii2SQ8DPlag09Ty9A", "stars": 3, "date": "2013-01-28", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "ZdeySE4xrL2c9xECRVDo4Q", "text": "Ah, ye old half star debate. Really, I think this place deserves 3.5 stars - definitely not a 3 but not ready for a 4 yet. But I want to give it positive vibes, as I think that the Birdcage is a fab addition to Musselburgh. If you can find it, that is. Be warned, it's off the main drag, in a semi-industrial estate (it's a converted cotton mill) and in the dark, an absolute bugger to find (first road on the left by the job centre, folks). I had all but given up when I saw my friend run out of her car, so followed her into a pedestrian quadrant where the Birdcage sat. \n\nIt's a very modern bar and restaurant, serving pretty modern dishes that are really rather unheard of in this town. Balsamic roasted beetroot with goats cheese and rocket salad? How on earth does that fit in with the local chippy? I don't think it does, but really, honestly and truly not a bad thing. Sadly, said salad didn't have the flavour I was expecting, the beetroot and rocket both overpowered by the cheese, and the vinegar didn't carry over any flavour at all, so I was a little disappointed, although overall it was a pleasant salad. \n\nMy main was a gnocchi (home made by the looks of it) with wild mushroom, drizzled with truffle oil. A little greasy for my liking, but I find mushroom dishes to be generally more greasy, so you can take that comment with a pinch of salt. My friend's angus burger and chips looked fabulous, and meaty (both chips and burger). \n\nWe both went all out with dessert - chocolate fondant for her, and sticky toffee pudding for me. Not something I normally order, but damn, the flavours were outstanding, with toffee and cinammon screaming out. Sponge itself was a little dry. \n\nSo you can probably see why this is a 3.5 star. Although the food was good, it wasn't amazing or hit the level of sophistication that this place is striving for. However, I don't want Birdcage to fail - perhaps, as it hasn't been open too long, it just needs to stretch its wings out a little more and will improve in time. I think that now that I have the option of old mans pub or trendy bar in my hometown as well, that I will be definitely back to drink some more here too, beats a bus ride into Edinburgh on a dark wintery night.", "business_id": "-rs3Rufq-9jy8z3eWWNd-Q", "stars": 4, "date": "2010-11-12", "type": "review"}, {"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "-ZtHkOGsagtYTsx0J8Trbw", "review_id": "9o9EafEkVtsuPqK93jObsg", "text": "Another hidden gem - you would not know it was there! Don't let the location fool you, this is a classy venue for a quiet meal out. Food is excellent and the ambience delightful. Great for an evening meal, weekend brunch or afternoon tea. Gorgeous interior and exterior view.", "business_id": "-rs3Rufq-9jy8z3eWWNd-Q", "stars": 5, "date": "2013-02-13", "type": "review"}, {"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "15XD4nQKUSwE8Vc7iGBikQ", "review_id": "p3WWDdhD_qaIFsJ4LQpOZQ", "text": "Hmmm....despite the surroundings the staff at the birdcage didn't get off to the best of starts...\nA beautiful sunny day with an entire restaurant empty and the only other table besides ours was next to us outside. In spite of having more staff than you could shake a stick at I still had to go inside to firstly get hold of a menu so that we could order. We were quite hungry so thought a couple of snack plates out in the sunshine would be nice. 10 minutes later we'd still not had our drinks order taken. Along comes a waitress...one Passionfruit Margarita and a coke please. No problem. 10 minutes after that someone comes out to say that \"I'm sorry we have no passionfruit would you like a normal Margarita?\" No worries, yes please. 10 minutes after that a lady comes outside with the one drink, the Margarita...erm excuse me we ordered a coke too please. \"Oh sorry, I'll just go and get it for you...\" 5 minutes later it arrived. She didn't even ask if we would like any food. My god not that we would now given the it's taken 35minutes to get a drink in an empty restaurant/bar...\n\nThe menu however does look nice. Perhaps we will give it a try during one of their 50% off days as if we receive the same level of service I won't feel so enraged with half off the meal.\n\nThe Jury is out but in the meantime I'm giving this place a 2 and it's only really for the surroundings not the minging Margarita or the poor poor service.", "business_id": "-rs3Rufq-9jy8z3eWWNd-Q", "stars": 2, "date": "2013-07-17", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sav3LcdqbclzQwRWwuezfw", "review_id": "_HxqGipZGNYaO5VPttSm9A", "text": "A wonderful, if tiny Pub.\n\nOodles of varied Real Ales on tap.\n\nGreat selection of Whiskies.\n\nThey pour a great pint.\n\nThis time , I had a lovely pint of Scottish Brewing's \"Houston Warlock Ale\". It was delicious with a hint of coffee and fruit .\n\nMost times I've been it's been standing room only, however, today I actually got a seat at the bar and watched the Cricket on the HD TV.\n\nIf you like your Beer, this is the place to visit.\n\nThoroughly recommended.", "business_id": "lb3DFVlpUR3w990XOPYpnw", "stars": 4, "date": "2014-05-20", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o4XEC_knhLrICxvTw67TDA", "review_id": "rXyXQmIywDJ74yESlNgYNg", "text": "Beer or Gelato? Hmmm.....\n\nWe stumbled upon Staggs on a hat wearing walk-about from Musselburgh races. However, our leader for the night knew exactly where he was going. And how apt since we were actually on a stag :-) The truth was I was really looking forward to a pistachio ice @ S.Luca's before the no.26 bus back to Edinburgh, but am I glad we stumbled upon what some would call the volunteers arms? Yes!\n\nStaggs is a small lively ale bar that any Camra member would be proud to rest his (or her) rather large posterior.  In fact it's been their national pub of the year on several occasions in the past. And it's not surprising with the array of fresh, ever revolving ales on tap. I think my tipple for the evening was a Tempest ipa and how enjoyable it was, especially quaffed with warm banter.\n\nSo after a couple of hours discovering new beer, ribbing locals on Edinburgh football's demise and arguing about the best hat to wear, we were soon ale'd up and it was time - sadly :'( I never did get to S.Luca's, but maybe the next time I'm in E.Lothian? However I may get waylaid? And as we all know beer and ice cream just don't mix :-\\", "business_id": "lb3DFVlpUR3w990XOPYpnw", "stars": 4, "date": "2014-05-29", "type": "review"}]