[{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "E_KAdo61uMDvIvqFcOX1Gw", "review_id": "e7MoZtaUOY_qHQ9npspjag", "text": "Check out the old video on this website: http://www.caliwaterpark.com/\n\nSomebody had BIG plans for this attraction venue, and things just didn't quite pan out.  What a shame.  One extra star for effort.\n\nToday, the lake is gone, the slides are torn down, and the entire place is in disrepair.  There isn't even a gas station at this exit.  Don't stop, unless you break down.", "business_id": "hqTZ-bMVmgtauVpJy7uTjg", "stars": 2, "date": "2010-07-04", "type": "review"}, {"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "OYwOyTUpILMAVqK4PebQdA", "review_id": "kqUmFllz3Q__MfTpwO4JDQ", "text": "I have been obsessing about this place for almost 4 years and 2 days ago I was able to stop by and tour the property. Sort of. A group of us stopped by the park at around 8 pm so it was pitch black and the only lights we had were our cellphone flashes. One of my friends decided that it was too creepy for her so she remained in the car and 2 of us ventured in to the park. We made it as far as the destroyed water fountain before we realized that we just did not have enough light to continue. From what we did see, the park (now abandoned and has been since 2004) is completely vandalized and run down. The store fronts (ticket booth, gift shop, arcade) were covered in graffiti. Glass was broken all over and what remaining equipment was destroyed. The parking lot was completely covered in desert sand and all signage was heavily sun damaged. That's as far as I saw because of the time I visited. I will definitely be coming back in the next couple of months and plan on making a stop during the day. And in case your wondering, the big slides are no longer there. After a show on MTV aired showing a group doing skateboard tricks off of the unused an dry water slides, whoever owned the place had them removed. The lazy river remains (empty of course) with tumble weeds strewn about (also filled with mattresses?) and the kiddie pool area does still have some items in tact. A quick visit but lots of fun. Can't wait to explore more. From what I understand someone is trying to revive this place but I highly doubt this will ever happen. This place was built in the middle of nowhere (no gas stations, stores, etc). It's not surprising that it closed. I'll be back Rock a Hoola!", "business_id": "hqTZ-bMVmgtauVpJy7uTjg", "stars": 5, "date": "2011-12-03", "type": "review"}, {"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "yaSXsmMTGYh--BX2yaNVgg", "review_id": "bpq5nhxzZn-D24O7D-jZNw", "text": "I didn't have service to check in here :/ but yeah.... I love this place.... Weird seeing how it looked so nice... Now it looks like something you would see in a zombie apocalypse movie hahaha my mom will never stop here :/ I always wanna stop and check it out xD haha I remember seeing this on the Rob and big show hahah I'm pretty sure they took the slides out after that episode was aired... But yeah if I ever go to Vegas with friends we are stopping and taking pictures ;D it does look pretty cool! My mom says she remembers driving by it with her parents when she was a kid and when it was open! Hard to imagine people swimming around in the middle of nowhere....", "business_id": "hqTZ-bMVmgtauVpJy7uTjg", "stars": 5, "date": "2014-07-09", "type": "review"}]