[{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qCeOF7gGjm2OPyei3MP9FA", "review_id": "zTwpf_q0ud0J9GAm5Ddmfw", "text": "I have placed orders for Halloween cookies, Christmas cookies and a birthday cake for someone with a nut allergy and all have turned out amazing. My go to place for sweets", "business_id": "j8pHQgSe4ZOrBbV1QZSj8g", "stars": 5, "date": "2013-06-07", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o_ABW8zFJYrelYhUF74kmA", "review_id": "8H3KxWD4Bis_ZQ-LPcRaiQ", "text": "I cannot say enough wonderful things about Shortcakes!  Shortcakes created an amazing cupcake cake for our wedding, and our guests raved about it.  The cupcakes were delicious, and the presentation was beautiful!  We can't wait to enjoy them again on our upcoming one-year anniversary.", "business_id": "j8pHQgSe4ZOrBbV1QZSj8g", "stars": 5, "date": "2013-06-07", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OYbp9mUflaNPiQ0UnuioFg", "review_id": "OZrNUs7S5JEXdkUflGukEw", "text": "I have used Shortcakes on MANY occasions and am impressed each time.  We had an elegant birthday party for my 50th birthday and Shortcakes provided the cake and other delicious desserts.  The prices are very reasonable and the presentation is beyond compare.", "business_id": "j8pHQgSe4ZOrBbV1QZSj8g", "stars": 5, "date": "2013-06-07", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PiB2qUyclyYyGFZVssTwpw", "review_id": "Jydmqca5UBfZm8VTcvQ2kA", "text": "I've had treats from ShortCakes many times and have never been disappointed.  The quality of the products is top notch and dealing with Nicole is nothing short of a pleasure.  The treats taste wonderful and are always beautiful and creative.  They are ready on time and everything is budget-friendly.  I would highly recommend ShortCakes for all of your pastry needs.", "business_id": "j8pHQgSe4ZOrBbV1QZSj8g", "stars": 5, "date": "2013-06-07", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g50aM54IUbIlD98JdvIDYg", "review_id": "fu07QwIJNfnzfLct6VqwlQ", "text": "I have two boys with birthdays closer together, which led us to ordering four cakes in less than a month from Shortcakes.  We loved all of them!!  The cake was delicious and my boys loved the artwork.  They are very accommodating and flexible and the cake design is really amazing!  I would highly recommend them!!", "business_id": "j8pHQgSe4ZOrBbV1QZSj8g", "stars": 5, "date": "2013-07-03", "type": "review"}]